-----------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/rogerchen/Documents/MATLAB/rc_thesis_irf/Emp_App/RZ_Active_Rep/tvar_results.log
  log type:  text
 opened on:  22 Sep 2024, 17:29:17

. *******************************************************************************;
. ** RAW DATA IMPORTATION AND DATA SETUP;
. *******************************************************************************;
. *import excel rzdat.xlsx, sheet("rzdat") firstrow;
. insheet using rzdatnew.csv;
(28 vars, 564 obs)

. drop if quarter<1889.75;
(59 observations deleted)

. gen qdate = q(1889q4) + _n-1;

. tsset qdate, q;

Time variable: qdate, 1889q4 to 2015q4
        Delta: 1 quarter

. /* World War II rationing sample.  Start in 1941q3 because of constraints on
>      auto production.  Most rationing ended in Aug/Sept 1945, a few items in
>          Nov/Dec 1945 */
> 
> gen wwii = quarter>=1941.5 & quarter<1946;

. gen nomit = 0;

.   /* indicator for no omit */
> 
> 
> *** DEFINE QUARTIC TREND;
. gen t = _n;

. gen t2 = t^2;

. gen t3 = t^3;

. gen t4 = t^4;

. *** DEFINE STATE VARIABLE;
. gen slack = unemp >= 6.5;

.   /* unemployment state with fixed threshold */
> 
> gen zlb = zlb_dummy;

.   /*  zlb state */
> 
> 
> *** NORMALIZATION;
. /* choice of potential GDP for normalization:
> 
>    rgdp_potCBO (cubic trend early, CBO late) or rgdp_pott6 (6th degree for full),
>    both fitted excluding Great Depression, WWII:  quarter>=1930 & quarter<1947*/
> 
> local ynorm rgdp_pott6;

.  /* rgdp_pott6 or rgdp_potcbo */
> 
> * BASIC VARIABLES;
. gen newsy = news/(L.`ynorm'*L.pgdp);
(1 missing value generated)

. gen rgov = ngov/pgdp;

. gen rtax = nfedcurrreceipts_nipa/pgdp;

. gen taxy = nfedcurrreceipts_nipa/ngdp;

. gen debty = pubfeddebt_treas/L.ngdp;
(3 missing values generated)

. gen lpgdp = ln(pgdp);

. gen infl = 400*D.lpgdp;
(1 missing value generated)

. * normalize variables and shorten names;
. gen y = rgdp/`ynorm';

. gen g = rgov/`ynorm';

.  gen bp = g;

.  /* Blanchard-Perotti shock is just orthogonalized current g */
> 
> * Calculate mean, median, etc. of slack duration;
. /*
> tsspell slack, end(hrend) seq(hrseq);
> summ hrseq if hrend & slack==1, detail;
> tab hrseq if hrend & slack==1;
> */
> *******************************************************************************;
. /* Options for VARs below
> 
> change sample according to:
> 
> no "if" is full sample
> if L.zlb ==1 or L.zlb==0
> if L.slack ==1 or L.slack==0;
> 
> add taxes:  var newsy g y taxy or var g y taxy;
> 
> add trends:  var newsy g y taxy if ..., lags(1/4) exog(t t2);
> 
> *******************************************************************************/
> 
> /* Military News identification;*/
> var newsy g  y if L.recession== 1, lags(1/4)
> irf create irf, step(20) set(irf, replace)
> irf table oirf, impulse(newsy) response(newsy g y)
> irf graph oirf, impulse(newsy) response(newsy g  y) byopts(rescale) saving(newsslack.gph, replace)
> 
> * Estimate VAR model
> var newsy g y if L.recession == 1, lags(1/4)
> irf create irf, step(20) bs reps(1000) seed(12345) set(irf, replace)
> irf table oirf, impulse(newsy) response(newsy g y) stderr
> irf graph oirf, impulse(newsy) response(newsy g y) lstep(0) ///
> irf graph oirf, impulse(newsy) response(newsy g y) lstep(0) ///
>     ci level(95) byopts(rescale) ///
>     saving(newsslack_bootstrap.gph, replace)
> 
> 
> *var newsy g  y if L.recession== 0, lags(1/4)
> *irf create irf, step(20) set(irf, replace)
> *irf table oirf, impulse(newsy) response(newsy g y)
> *irf graph oirf, impulse(newsy) response(newsy g  y) byopts(rescale) saving(newsnoslack.gph, replace)

end of do-file

. var newsy g  y if L.recession== 1, lags(1/4)

Vector autoregression

Sample: 1891q1 thru 2009q3, but with gaps       Number of obs     =        144
Log likelihood =   1215.969                     AIC               =  -16.34679
FPE            =   1.60e-11                     HQIC              =  -16.01996
Det(Sigma_ml)  =   9.29e-12                     SBIC              =  -15.54246

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
newsy                13     .016881   0.5307   162.8704   0.0000
g                    13      .00967   0.9882   12069.05   0.0000
y                    13     .023846   0.9442   2437.472   0.0000
----------------------------------------------------------------

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
newsy        |
       newsy |
         L1. |  -.4626967   .0844351    -5.48   0.000    -.6281864   -.2972069
         L2. |   -.553284   .0689464    -8.02   0.000    -.6884165   -.4181515
         L3. |  -.5561581   .0830498    -6.70   0.000    -.7189327   -.3933836
         L4. |  -.3785666   .0639005    -5.92   0.000    -.5038092    -.253324
             |
           g |
         L1. |   .3856788   .1507435     2.56   0.011     .0902269    .6811307
         L2. |   -.161269    .251431    -0.64   0.521    -.6540646    .3315266
         L3. |  -.3409109   .2348351    -1.45   0.147    -.8011792    .1193575
         L4. |   .0630003   .1476619     0.43   0.670    -.2264117    .3524123
             |
           y |
         L1. |   .0449402   .0713492     0.63   0.529    -.0949017     .184782
         L2. |   -.132682   .1233668    -1.08   0.282    -.3744766    .1091126
         L3. |   .1919536   .1223591     1.57   0.117    -.0478658    .4317729
         L4. |  -.1419527   .0716266    -1.98   0.047    -.2823382   -.0015672
             |
       _cons |   .0460824   .0171084     2.69   0.007     .0125506    .0796142
-------------+----------------------------------------------------------------
g            |
       newsy |
         L1. |   .2273138   .0483676     4.70   0.000      .132515    .3221126
         L2. |   .1619705   .0394951     4.10   0.000     .0845615    .2393795
         L3. |   -.153861   .0475741    -3.23   0.001    -.2471044   -.0606176
         L4. |  -.1612913   .0366046    -4.41   0.000     -.233035   -.0895476
             |
           g |
         L1. |   1.277971   .0863516    14.80   0.000     1.108725    1.447217
         L2. |  -.2743545   .1440292    -1.90   0.057    -.5566466    .0079375
         L3. |   .0481993   .1345224     0.36   0.720    -.2154599    .3118585
         L4. |  -.1179698   .0845863    -1.39   0.163     -.283756    .0478163
             |
           y |
         L1. |    .001729   .0408715     0.04   0.966    -.0783778    .0818357
         L2. |  -.0004244   .0706692    -0.01   0.995    -.1389335    .1380847
         L3. |   .0076189   .0700919     0.11   0.913    -.1297587    .1449965
         L4. |  -.0355153   .0410304    -0.87   0.387    -.1159334    .0449028
             |
       _cons |   .0345891   .0098003     3.53   0.000     .0153808    .0537974
-------------+----------------------------------------------------------------
y            |
       newsy |
         L1. |  -.0060442   .1192717    -0.05   0.960    -.2398125     .227724
         L2. |  -.1969211   .0973927    -2.02   0.043    -.3878072    -.006035
         L3. |  -.2087978   .1173148    -1.78   0.075    -.4387307     .021135
         L4. |  -.0707198   .0902648    -0.78   0.433    -.2476356     .106196
             |
           g |
         L1. |   .2266495    .212938     1.06   0.287    -.1907014    .6440003
         L2. |    .118422   .3551676     0.33   0.739    -.5776937    .8145376
         L3. |   -.429009   .3317245    -1.29   0.196    -1.079177    .2211591
         L4. |   .0972282   .2085849     0.47   0.641    -.3115907    .5060472
             |
           y |
         L1. |   1.449335   .1007868    14.38   0.000     1.251797    1.646874
         L2. |  -.7387716   .1742661    -4.24   0.000    -1.080327   -.3972163
         L3. |   .3783301   .1728426     2.19   0.029     .0395649    .7170953
         L4. |  -.1503013   .1011786    -1.49   0.137    -.3486077    .0480051
             |
       _cons |   .0524084    .024167     2.17   0.030     .0050419     .099775
------------------------------------------------------------------------------

. irf create irf, step(20) set(irf, replace)
(file irf.irf created)
(file irf.irf now active)
(file irf.irf updated)

. irf table oirf, impulse(newsy) response(newsy g y)

Results from irf

--------------------------------------------------------------------------------
         |      (1)         (1)         (1)         (2)         (2)         (2)  
    Step |     oirf       Lower       Upper        oirf       Lower       Upper  
---------+----------------------------------------------------------------------
       0 |  .016101     .014242     .017961     .003768     .002326      .00521
       1 | -.005869    -.008374    -.003365     .008481      .00606     .010901
       2 | -.003687    -.005841    -.001533     .011085     .008027     .014143
       3 | -.002292    -.004766     .000183     .007782     .004113      .01145
       4 | -.001048    -.003211     .001114     .003996     .000077     .007916
       5 |  .002913     .000735     .005092     .003275     -.00037      .00692
       6 |  .000259     -.00172     .002239     .003476     .000262      .00669
       7 | -.000421    -.002059     .001216     .003796     .001143     .006448
       8 | -.001261     -.00249    -.000033     .003148     .000791     .005504
       9 | -.001001     -.00197    -.000032     .001802      -.0005     .004103
      10 |  .000295     -.00073     .001321     .000729    -.001481      .00294
      11 |  .000326    -.000402     .001053     .000244    -.001948     .002436
      12 |  .000184    -.000591     .000959     .000255    -.001999     .002509
      13 | -.000199    -.000807     .000409     .000259    -.002104     .002621
      14 | -.000328    -.000765     .000109     .000053    -.002401     .002506
      15 |  -.00008    -.000529     .000368    -.000217    -.002628     .002194
      16 |  .000081    -.000264     .000425    -.000383     -.00262     .001855
      17 |  .000149    -.000129     .000427    -.000365    -.002393     .001663
      18 |  .000062    -.000198     .000321    -.000257    -.002099     .001585
      19 | -.000034    -.000252     .000184    -.000169    -.001858      .00152
      20 | -.000035    -.000221     .000152    -.000137    -.001683      .00141
--------------------------------------------------------------------------------

---------------------------------------------
         |      (3)         (3)         (3)  
    Step |     oirf       Lower       Upper  
---------+-----------------------------------
       0 |   .00283    -.000871      .00653
       1 |  .004858    -.001442     .011157
       2 |  .004183    -.002696     .011063
       3 |  .003261    -.004175     .010697
       4 |   .00368    -.004646     .012005
       5 |  .003315    -.004619     .011249
       6 |  .002574    -.003995     .009144
       7 |  .002208    -.002874     .007289
       8 |  .001672     -.00275     .006094
       9 |  .001088     -.00285     .005027
      10 |  .000605    -.002767     .003977
      11 |   .00026    -.002739     .003258
      12 |  2.7e-06    -.002952     .002958
      13 |  -.00023    -.003329     .002869
      14 | -.000396    -.003579     .002786
      15 | -.000506    -.003583     .002571
      16 | -.000563    -.003452     .002325
      17 |  -.00057    -.003285     .002144
      18 | -.000549    -.003086     .001989
      19 |  -.00051    -.002827     .001806
      20 | -.000463    -.002494     .001568
---------------------------------------------
95% lower and upper bounds reported.
(1) irfname = irf, impulse = newsy, and response = newsy.
(2) irfname = irf, impulse = newsy, and response = g.
(3) irfname = irf, impulse = newsy, and response = y.

. irf graph oirf, impulse(newsy) response(newsy g  y) byopts(rescale) saving(newsslack.gph, replace)
(file newsslack.gph not found)
file newsslack.gph saved

. var newsy g  y if L.recession== 1, lags(1/4)

Vector autoregression

Sample: 1891q1 thru 2009q3, but with gaps       Number of obs     =        144
Log likelihood =   1215.969                     AIC               =  -16.34679
FPE            =   1.60e-11                     HQIC              =  -16.01996
Det(Sigma_ml)  =   9.29e-12                     SBIC              =  -15.54246

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
newsy                13     .016881   0.5307   162.8704   0.0000
g                    13      .00967   0.9882   12069.05   0.0000
y                    13     .023846   0.9442   2437.472   0.0000
----------------------------------------------------------------

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
newsy        |
       newsy |
         L1. |  -.4626967   .0844351    -5.48   0.000    -.6281864   -.2972069
         L2. |   -.553284   .0689464    -8.02   0.000    -.6884165   -.4181515
         L3. |  -.5561581   .0830498    -6.70   0.000    -.7189327   -.3933836
         L4. |  -.3785666   .0639005    -5.92   0.000    -.5038092    -.253324
             |
           g |
         L1. |   .3856788   .1507435     2.56   0.011     .0902269    .6811307
         L2. |   -.161269    .251431    -0.64   0.521    -.6540646    .3315266
         L3. |  -.3409109   .2348351    -1.45   0.147    -.8011792    .1193575
         L4. |   .0630003   .1476619     0.43   0.670    -.2264117    .3524123
             |
           y |
         L1. |   .0449402   .0713492     0.63   0.529    -.0949017     .184782
         L2. |   -.132682   .1233668    -1.08   0.282    -.3744766    .1091126
         L3. |   .1919536   .1223591     1.57   0.117    -.0478658    .4317729
         L4. |  -.1419527   .0716266    -1.98   0.047    -.2823382   -.0015672
             |
       _cons |   .0460824   .0171084     2.69   0.007     .0125506    .0796142
-------------+----------------------------------------------------------------
g            |
       newsy |
         L1. |   .2273138   .0483676     4.70   0.000      .132515    .3221126
         L2. |   .1619705   .0394951     4.10   0.000     .0845615    .2393795
         L3. |   -.153861   .0475741    -3.23   0.001    -.2471044   -.0606176
         L4. |  -.1612913   .0366046    -4.41   0.000     -.233035   -.0895476
             |
           g |
         L1. |   1.277971   .0863516    14.80   0.000     1.108725    1.447217
         L2. |  -.2743545   .1440292    -1.90   0.057    -.5566466    .0079375
         L3. |   .0481993   .1345224     0.36   0.720    -.2154599    .3118585
         L4. |  -.1179698   .0845863    -1.39   0.163     -.283756    .0478163
             |
           y |
         L1. |    .001729   .0408715     0.04   0.966    -.0783778    .0818357
         L2. |  -.0004244   .0706692    -0.01   0.995    -.1389335    .1380847
         L3. |   .0076189   .0700919     0.11   0.913    -.1297587    .1449965
         L4. |  -.0355153   .0410304    -0.87   0.387    -.1159334    .0449028
             |
       _cons |   .0345891   .0098003     3.53   0.000     .0153808    .0537974
-------------+----------------------------------------------------------------
y            |
       newsy |
         L1. |  -.0060442   .1192717    -0.05   0.960    -.2398125     .227724
         L2. |  -.1969211   .0973927    -2.02   0.043    -.3878072    -.006035
         L3. |  -.2087978   .1173148    -1.78   0.075    -.4387307     .021135
         L4. |  -.0707198   .0902648    -0.78   0.433    -.2476356     .106196
             |
           g |
         L1. |   .2266495    .212938     1.06   0.287    -.1907014    .6440003
         L2. |    .118422   .3551676     0.33   0.739    -.5776937    .8145376
         L3. |   -.429009   .3317245    -1.29   0.196    -1.079177    .2211591
         L4. |   .0972282   .2085849     0.47   0.641    -.3115907    .5060472
             |
           y |
         L1. |   1.449335   .1007868    14.38   0.000     1.251797    1.646874
         L2. |  -.7387716   .1742661    -4.24   0.000    -1.080327   -.3972163
         L3. |   .3783301   .1728426     2.19   0.029     .0395649    .7170953
         L4. |  -.1503013   .1011786    -1.49   0.137    -.3486077    .0480051
             |
       _cons |   .0524084    .024167     2.17   0.030     .0050419     .099775
------------------------------------------------------------------------------

. irf create irf, step(20) set(irf, replace)
(file irf.irf created)
(file irf.irf now active)
(file irf.irf updated)

. irf table oirf, impulse(newsy) response(newsy g y)

Results from irf

--------------------------------------------------------------------------------
         |      (1)         (1)         (1)         (2)         (2)         (2)  
    Step |     oirf       Lower       Upper        oirf       Lower       Upper  
---------+----------------------------------------------------------------------
       0 |  .016101     .014242     .017961     .003768     .002326      .00521
       1 | -.005869    -.008374    -.003365     .008481      .00606     .010901
       2 | -.003687    -.005841    -.001533     .011085     .008027     .014143
       3 | -.002292    -.004766     .000183     .007782     .004113      .01145
       4 | -.001048    -.003211     .001114     .003996     .000077     .007916
       5 |  .002913     .000735     .005092     .003275     -.00037      .00692
       6 |  .000259     -.00172     .002239     .003476     .000262      .00669
       7 | -.000421    -.002059     .001216     .003796     .001143     .006448
       8 | -.001261     -.00249    -.000033     .003148     .000791     .005504
       9 | -.001001     -.00197    -.000032     .001802      -.0005     .004103
      10 |  .000295     -.00073     .001321     .000729    -.001481      .00294
      11 |  .000326    -.000402     .001053     .000244    -.001948     .002436
      12 |  .000184    -.000591     .000959     .000255    -.001999     .002509
      13 | -.000199    -.000807     .000409     .000259    -.002104     .002621
      14 | -.000328    -.000765     .000109     .000053    -.002401     .002506
      15 |  -.00008    -.000529     .000368    -.000217    -.002628     .002194
      16 |  .000081    -.000264     .000425    -.000383     -.00262     .001855
      17 |  .000149    -.000129     .000427    -.000365    -.002393     .001663
      18 |  .000062    -.000198     .000321    -.000257    -.002099     .001585
      19 | -.000034    -.000252     .000184    -.000169    -.001858      .00152
      20 | -.000035    -.000221     .000152    -.000137    -.001683      .00141
--------------------------------------------------------------------------------

---------------------------------------------
         |      (3)         (3)         (3)  
    Step |     oirf       Lower       Upper  
---------+-----------------------------------
       0 |   .00283    -.000871      .00653
       1 |  .004858    -.001442     .011157
       2 |  .004183    -.002696     .011063
       3 |  .003261    -.004175     .010697
       4 |   .00368    -.004646     .012005
       5 |  .003315    -.004619     .011249
       6 |  .002574    -.003995     .009144
       7 |  .002208    -.002874     .007289
       8 |  .001672     -.00275     .006094
       9 |  .001088     -.00285     .005027
      10 |  .000605    -.002767     .003977
      11 |   .00026    -.002739     .003258
      12 |  2.7e-06    -.002952     .002958
      13 |  -.00023    -.003329     .002869
      14 | -.000396    -.003579     .002786
      15 | -.000506    -.003583     .002571
      16 | -.000563    -.003452     .002325
      17 |  -.00057    -.003285     .002144
      18 | -.000549    -.003086     .001989
      19 |  -.00051    -.002827     .001806
      20 | -.000463    -.002494     .001568
---------------------------------------------
95% lower and upper bounds reported.
(1) irfname = irf, impulse = newsy, and response = newsy.
(2) irfname = irf, impulse = newsy, and response = g.
(3) irfname = irf, impulse = newsy, and response = y.

. irf graph oirf, impulse(newsy) response(newsy g  y) byopts(rescale) saving(newsslack.gph, replace)
file newsslack.gph saved

. var newsy g y if L.recession == 1, lags(1/4)

Vector autoregression

Sample: 1891q1 thru 2009q3, but with gaps       Number of obs     =        144
Log likelihood =   1215.969                     AIC               =  -16.34679
FPE            =   1.60e-11                     HQIC              =  -16.01996
Det(Sigma_ml)  =   9.29e-12                     SBIC              =  -15.54246

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
newsy                13     .016881   0.5307   162.8704   0.0000
g                    13      .00967   0.9882   12069.05   0.0000
y                    13     .023846   0.9442   2437.472   0.0000
----------------------------------------------------------------

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
newsy        |
       newsy |
         L1. |  -.4626967   .0844351    -5.48   0.000    -.6281864   -.2972069
         L2. |   -.553284   .0689464    -8.02   0.000    -.6884165   -.4181515
         L3. |  -.5561581   .0830498    -6.70   0.000    -.7189327   -.3933836
         L4. |  -.3785666   .0639005    -5.92   0.000    -.5038092    -.253324
             |
           g |
         L1. |   .3856788   .1507435     2.56   0.011     .0902269    .6811307
         L2. |   -.161269    .251431    -0.64   0.521    -.6540646    .3315266
         L3. |  -.3409109   .2348351    -1.45   0.147    -.8011792    .1193575
         L4. |   .0630003   .1476619     0.43   0.670    -.2264117    .3524123
             |
           y |
         L1. |   .0449402   .0713492     0.63   0.529    -.0949017     .184782
         L2. |   -.132682   .1233668    -1.08   0.282    -.3744766    .1091126
         L3. |   .1919536   .1223591     1.57   0.117    -.0478658    .4317729
         L4. |  -.1419527   .0716266    -1.98   0.047    -.2823382   -.0015672
             |
       _cons |   .0460824   .0171084     2.69   0.007     .0125506    .0796142
-------------+----------------------------------------------------------------
g            |
       newsy |
         L1. |   .2273138   .0483676     4.70   0.000      .132515    .3221126
         L2. |   .1619705   .0394951     4.10   0.000     .0845615    .2393795
         L3. |   -.153861   .0475741    -3.23   0.001    -.2471044   -.0606176
         L4. |  -.1612913   .0366046    -4.41   0.000     -.233035   -.0895476
             |
           g |
         L1. |   1.277971   .0863516    14.80   0.000     1.108725    1.447217
         L2. |  -.2743545   .1440292    -1.90   0.057    -.5566466    .0079375
         L3. |   .0481993   .1345224     0.36   0.720    -.2154599    .3118585
         L4. |  -.1179698   .0845863    -1.39   0.163     -.283756    .0478163
             |
           y |
         L1. |    .001729   .0408715     0.04   0.966    -.0783778    .0818357
         L2. |  -.0004244   .0706692    -0.01   0.995    -.1389335    .1380847
         L3. |   .0076189   .0700919     0.11   0.913    -.1297587    .1449965
         L4. |  -.0355153   .0410304    -0.87   0.387    -.1159334    .0449028
             |
       _cons |   .0345891   .0098003     3.53   0.000     .0153808    .0537974
-------------+----------------------------------------------------------------
y            |
       newsy |
         L1. |  -.0060442   .1192717    -0.05   0.960    -.2398125     .227724
         L2. |  -.1969211   .0973927    -2.02   0.043    -.3878072    -.006035
         L3. |  -.2087978   .1173148    -1.78   0.075    -.4387307     .021135
         L4. |  -.0707198   .0902648    -0.78   0.433    -.2476356     .106196
             |
           g |
         L1. |   .2266495    .212938     1.06   0.287    -.1907014    .6440003
         L2. |    .118422   .3551676     0.33   0.739    -.5776937    .8145376
         L3. |   -.429009   .3317245    -1.29   0.196    -1.079177    .2211591
         L4. |   .0972282   .2085849     0.47   0.641    -.3115907    .5060472
             |
           y |
         L1. |   1.449335   .1007868    14.38   0.000     1.251797    1.646874
         L2. |  -.7387716   .1742661    -4.24   0.000    -1.080327   -.3972163
         L3. |   .3783301   .1728426     2.19   0.029     .0395649    .7170953
         L4. |  -.1503013   .1011786    -1.49   0.137    -.3486077    .0480051
             |
       _cons |   .0524084    .024167     2.17   0.030     .0050419     .099775
------------------------------------------------------------------------------

. irf create irf, step(20) bs reps(1000) seed(12345) set(irf, replace)
option seed() not allowed
r(198);

. irf table oirf, impulse(newsy) response(newsy g y) stderr

Results from irf

--------------------------------------------------------------------------------------------------------
         |      (1)         (1)         (1)         (1)         (2)         (2)         (2)         (2)  
    Step |     oirf       Lower       Upper        S.E.        oirf       Lower       Upper        S.E.  
---------+----------------------------------------------------------------------------------------------
       0 |  .016101     .014242     .017961     .000949     .003768     .002326      .00521     .000736
       1 | -.005869    -.008374    -.003365     .001278     .008481      .00606     .010901     .001235
       2 | -.003687    -.005841    -.001533     .001099     .011085     .008027     .014143      .00156
       3 | -.002292    -.004766     .000183     .001263     .007782     .004113      .01145     .001872
       4 | -.001048    -.003211     .001114     .001103     .003996     .000077     .007916        .002
       5 |  .002913     .000735     .005092     .001111     .003275     -.00037      .00692      .00186
       6 |  .000259     -.00172     .002239      .00101     .003476     .000262      .00669      .00164
       7 | -.000421    -.002059     .001216     .000836     .003796     .001143     .006448     .001353
       8 | -.001261     -.00249    -.000033     .000627     .003148     .000791     .005504     .001202
       9 | -.001001     -.00197    -.000032     .000494     .001802      -.0005     .004103     .001174
      10 |  .000295     -.00073     .001321     .000523     .000729    -.001481      .00294     .001128
      11 |  .000326    -.000402     .001053     .000371     .000244    -.001948     .002436     .001118
      12 |  .000184    -.000591     .000959     .000395     .000255    -.001999     .002509      .00115
      13 | -.000199    -.000807     .000409      .00031     .000259    -.002104     .002621     .001205
      14 | -.000328    -.000765     .000109     .000223     .000053    -.002401     .002506     .001252
      15 |  -.00008    -.000529     .000368     .000229    -.000217    -.002628     .002194      .00123
      16 |  .000081    -.000264     .000425     .000176    -.000383     -.00262     .001855     .001142
      17 |  .000149    -.000129     .000427     .000142    -.000365    -.002393     .001663     .001035
      18 |  .000062    -.000198     .000321     .000132    -.000257    -.002099     .001585      .00094
      19 | -.000034    -.000252     .000184     .000111    -.000169    -.001858      .00152     .000862
      20 | -.000035    -.000221     .000152     .000095    -.000137    -.001683      .00141     .000789
--------------------------------------------------------------------------------------------------------

---------------------------------------------------------
         |      (3)         (3)         (3)         (3)  
    Step |     oirf       Lower       Upper        S.E.  
---------+-----------------------------------------------
       0 |   .00283    -.000871      .00653     .001888
       1 |  .004858    -.001442     .011157     .003214
       2 |  .004183    -.002696     .011063      .00351
       3 |  .003261    -.004175     .010697     .003794
       4 |   .00368    -.004646     .012005     .004248
       5 |  .003315    -.004619     .011249     .004048
       6 |  .002574    -.003995     .009144     .003352
       7 |  .002208    -.002874     .007289     .002593
       8 |  .001672     -.00275     .006094     .002256
       9 |  .001088     -.00285     .005027      .00201
      10 |  .000605    -.002767     .003977      .00172
      11 |   .00026    -.002739     .003258      .00153
      12 |  2.7e-06    -.002952     .002958     .001508
      13 |  -.00023    -.003329     .002869     .001581
      14 | -.000396    -.003579     .002786     .001624
      15 | -.000506    -.003583     .002571      .00157
      16 | -.000563    -.003452     .002325     .001474
      17 |  -.00057    -.003285     .002144     .001385
      18 | -.000549    -.003086     .001989     .001295
      19 |  -.00051    -.002827     .001806     .001182
      20 | -.000463    -.002494     .001568     .001036
---------------------------------------------------------
95% lower and upper bounds reported.
(1) irfname = irf, impulse = newsy, and response = newsy.
(2) irfname = irf, impulse = newsy, and response = g.
(3) irfname = irf, impulse = newsy, and response = y.

. irf graph oirf, impulse(newsy) response(newsy g y) lstep(0) ///
option / not allowed
r(198);

. irf graph oirf, impulse(newsy) response(newsy g y) lstep(0) ///
option / not allowed
r(198);

.     ci level(95) byopts(rescale) ///
you must specify one of means, proportions, or variances following ci
r(198);

.     saving(newsslack_bootstrap.gph, replace)
command saving is unrecognized
r(199);

. do "/var/folders/pg/kxdb7btd5b3gr0373l7m6vbm0000gp/T//SD36971.000000"

. var newsy g y if L.recession == 1, lags(1/4)

Vector autoregression

Sample: 1891q1 thru 2009q3, but with gaps       Number of obs     =        144
Log likelihood =   1215.969                     AIC               =  -16.34679
FPE            =   1.60e-11                     HQIC              =  -16.01996
Det(Sigma_ml)  =   9.29e-12                     SBIC              =  -15.54246

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
newsy                13     .016881   0.5307   162.8704   0.0000
g                    13      .00967   0.9882   12069.05   0.0000
y                    13     .023846   0.9442   2437.472   0.0000
----------------------------------------------------------------

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
newsy        |
       newsy |
         L1. |  -.4626967   .0844351    -5.48   0.000    -.6281864   -.2972069
         L2. |   -.553284   .0689464    -8.02   0.000    -.6884165   -.4181515
         L3. |  -.5561581   .0830498    -6.70   0.000    -.7189327   -.3933836
         L4. |  -.3785666   .0639005    -5.92   0.000    -.5038092    -.253324
             |
           g |
         L1. |   .3856788   .1507435     2.56   0.011     .0902269    .6811307
         L2. |   -.161269    .251431    -0.64   0.521    -.6540646    .3315266
         L3. |  -.3409109   .2348351    -1.45   0.147    -.8011792    .1193575
         L4. |   .0630003   .1476619     0.43   0.670    -.2264117    .3524123
             |
           y |
         L1. |   .0449402   .0713492     0.63   0.529    -.0949017     .184782
         L2. |   -.132682   .1233668    -1.08   0.282    -.3744766    .1091126
         L3. |   .1919536   .1223591     1.57   0.117    -.0478658    .4317729
         L4. |  -.1419527   .0716266    -1.98   0.047    -.2823382   -.0015672
             |
       _cons |   .0460824   .0171084     2.69   0.007     .0125506    .0796142
-------------+----------------------------------------------------------------
g            |
       newsy |
         L1. |   .2273138   .0483676     4.70   0.000      .132515    .3221126
         L2. |   .1619705   .0394951     4.10   0.000     .0845615    .2393795
         L3. |   -.153861   .0475741    -3.23   0.001    -.2471044   -.0606176
         L4. |  -.1612913   .0366046    -4.41   0.000     -.233035   -.0895476
             |
           g |
         L1. |   1.277971   .0863516    14.80   0.000     1.108725    1.447217
         L2. |  -.2743545   .1440292    -1.90   0.057    -.5566466    .0079375
         L3. |   .0481993   .1345224     0.36   0.720    -.2154599    .3118585
         L4. |  -.1179698   .0845863    -1.39   0.163     -.283756    .0478163
             |
           y |
         L1. |    .001729   .0408715     0.04   0.966    -.0783778    .0818357
         L2. |  -.0004244   .0706692    -0.01   0.995    -.1389335    .1380847
         L3. |   .0076189   .0700919     0.11   0.913    -.1297587    .1449965
         L4. |  -.0355153   .0410304    -0.87   0.387    -.1159334    .0449028
             |
       _cons |   .0345891   .0098003     3.53   0.000     .0153808    .0537974
-------------+----------------------------------------------------------------
y            |
       newsy |
         L1. |  -.0060442   .1192717    -0.05   0.960    -.2398125     .227724
         L2. |  -.1969211   .0973927    -2.02   0.043    -.3878072    -.006035
         L3. |  -.2087978   .1173148    -1.78   0.075    -.4387307     .021135
         L4. |  -.0707198   .0902648    -0.78   0.433    -.2476356     .106196
             |
           g |
         L1. |   .2266495    .212938     1.06   0.287    -.1907014    .6440003
         L2. |    .118422   .3551676     0.33   0.739    -.5776937    .8145376
         L3. |   -.429009   .3317245    -1.29   0.196    -1.079177    .2211591
         L4. |   .0972282   .2085849     0.47   0.641    -.3115907    .5060472
             |
           y |
         L1. |   1.449335   .1007868    14.38   0.000     1.251797    1.646874
         L2. |  -.7387716   .1742661    -4.24   0.000    -1.080327   -.3972163
         L3. |   .3783301   .1728426     2.19   0.029     .0395649    .7170953
         L4. |  -.1503013   .1011786    -1.49   0.137    -.3486077    .0480051
             |
       _cons |   .0524084    .024167     2.17   0.030     .0050419     .099775
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/pg/kxdb7btd5b3gr0373l7m6vbm0000gp/T//SD36971.000
> 000"

. var newsy g y if L.recession == 1, lags(1/4)

Vector autoregression

Sample: 1891q1 thru 2009q3, but with gaps       Number of obs     =
>         144
Log likelihood =   1215.969                     AIC               =
>   -16.34679
FPE            =   1.60e-11                     HQIC              =
>   -16.01996
Det(Sigma_ml)  =   9.29e-12                     SBIC              =
>   -15.54246

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
newsy                13     .016881   0.5307   162.8704   0.0000
g                    13      .00967   0.9882   12069.05   0.0000
y                    13     .023846   0.9442   2437.472   0.0000
----------------------------------------------------------------

-------------------------------------------------------------------
> -----------
             | Coefficient  Std. err.      z    P>|z|     [95% conf
> . interval]
-------------+-----------------------------------------------------
> -----------
newsy        |
       newsy |
         L1. |  -.4626967   .0844351    -5.48   0.000    -.6281864 
>   -.2972069
         L2. |   -.553284   .0689464    -8.02   0.000    -.6884165 
>   -.4181515
         L3. |  -.5561581   .0830498    -6.70   0.000    -.7189327 
>   -.3933836
         L4. |  -.3785666   .0639005    -5.92   0.000    -.5038092 
>    -.253324
             |
           g |
         L1. |   .3856788   .1507435     2.56   0.011     .0902269 
>    .6811307
         L2. |   -.161269    .251431    -0.64   0.521    -.6540646 
>    .3315266
         L3. |  -.3409109   .2348351    -1.45   0.147    -.8011792 
>    .1193575
         L4. |   .0630003   .1476619     0.43   0.670    -.2264117 
>    .3524123
             |
           y |
         L1. |   .0449402   .0713492     0.63   0.529    -.0949017 
>     .184782
         L2. |   -.132682   .1233668    -1.08   0.282    -.3744766 
>    .1091126
         L3. |   .1919536   .1223591     1.57   0.117    -.0478658 
>    .4317729
         L4. |  -.1419527   .0716266    -1.98   0.047    -.2823382 
>   -.0015672
             |
       _cons |   .0460824   .0171084     2.69   0.007     .0125506 
>    .0796142
-------------+-----------------------------------------------------
> -----------
g            |
       newsy |
         L1. |   .2273138   .0483676     4.70   0.000      .132515 
>    .3221126
         L2. |   .1619705   .0394951     4.10   0.000     .0845615 
>    .2393795
         L3. |   -.153861   .0475741    -3.23   0.001    -.2471044 
>   -.0606176
         L4. |  -.1612913   .0366046    -4.41   0.000     -.233035 
>   -.0895476
             |
           g |
         L1. |   1.277971   .0863516    14.80   0.000     1.108725 
>    1.447217
         L2. |  -.2743545   .1440292    -1.90   0.057    -.5566466 
>    .0079375
         L3. |   .0481993   .1345224     0.36   0.720    -.2154599 
>    .3118585
         L4. |  -.1179698   .0845863    -1.39   0.163     -.283756 
>    .0478163
             |
           y |
         L1. |    .001729   .0408715     0.04   0.966    -.0783778 
>    .0818357
         L2. |  -.0004244   .0706692    -0.01   0.995    -.1389335 
>    .1380847
         L3. |   .0076189   .0700919     0.11   0.913    -.1297587 
>    .1449965
         L4. |  -.0355153   .0410304    -0.87   0.387    -.1159334 
>    .0449028
             |
       _cons |   .0345891   .0098003     3.53   0.000     .0153808 
>    .0537974
-------------+-----------------------------------------------------
> -----------
y            |
       newsy |
         L1. |  -.0060442   .1192717    -0.05   0.960    -.2398125 
>     .227724
         L2. |  -.1969211   .0973927    -2.02   0.043    -.3878072 
>    -.006035
         L3. |  -.2087978   .1173148    -1.78   0.075    -.4387307 
>     .021135
         L4. |  -.0707198   .0902648    -0.78   0.433    -.2476356 
>     .106196
             |
           g |
         L1. |   .2266495    .212938     1.06   0.287    -.1907014 
>    .6440003
         L2. |    .118422   .3551676     0.33   0.739    -.5776937 
>    .8145376
         L3. |   -.429009   .3317245    -1.29   0.196    -1.079177 
>    .2211591
         L4. |   .0972282   .2085849     0.47   0.641    -.3115907 
>    .5060472
             |
           y |
         L1. |   1.449335   .1007868    14.38   0.000     1.251797 
>    1.646874
         L2. |  -.7387716   .1742661    -4.24   0.000    -1.080327 
>   -.3972163
         L3. |   .3783301   .1728426     2.19   0.029     .0395649 
>    .7170953
         L4. |  -.1503013   .1011786    -1.49   0.137    -.3486077 
>    .0480051
             |
       _cons |   .0524084    .024167     2.17   0.030     .0050419 
>     .099775
-------------------------------------------------------------------
> -----------

. 
end of do-file

. do "/var/folders/pg/kxdb7btd5b3gr0373l7m6vbm0000gp/T//SD36971.000
> 000"

. irf create irf, step(20) bs reps(1000) set(irf, replace)
(file irf.irf created)
(file irf.irf now active)
bootstrap methods not available with gaps in the data
r(198);

end of do-file

r(198);

. do "/var/folders/pg/kxdb7btd5b3gr0373l7m6vbm0000gp/T//SD36971.000
> 000"

. irf table oirf, impulse(newsy) response(newsy g y) stderr
file irf.irf is not a valid irf file
r(198);

end of do-file

r(198);

. do "/var/folders/pg/kxdb7btd5b3gr0373l7m6vbm0000gp/T//SD36971.000
> 000"

. irf graph oirf, impulse(newsy) response(newsy g y) lstep(0)
file irf.irf is not a valid irf file
r(198);

end of do-file

r(198);

