------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\Client\C$\Users\rogerchen\Documents\MATLAB\rc_thesis_irf\Emp_App\RZ_Original\tvar_results.log
  log type:  text
 opened on:   8 Sep 2024, 17:57:08

. *******************************************************************************;
. ** RAW DATA IMPORTATION AND DATA SETUP;
. *******************************************************************************;
. *import excel rzdat.xlsx, sheet("rzdat") firstrow;
. insheet using rzdatnew.csv;
(28 vars, 564 obs)

. drop if quarter<1889.75;
(59 observations deleted)

. gen qdate = q(1889q4) + _n-1;

. tsset qdate, q;
        time variable:  qdate, 1889q4 to 2015q4
                delta:  1 quarter

. /* World War II rationing sample.  Start in 1941q3 because of constraints on
>      auto production.  Most rationing ended in Aug/Sept 1945, a few items in
>          Nov/Dec 1945 */
> 
> gen wwii = quarter>=1941.5 & quarter<1946;

. gen nomit = 0;

.   /* indicator for no omit */
> 
> 
> *** DEFINE QUARTIC TREND;
. gen t = _n;

. gen t2 = t^2;

. gen t3 = t^3;

. gen t4 = t^4;

. *** DEFINE STATE VARIABLE;
. gen slack = unemp >= 6.5;

.   /* unemployment state with fixed threshold */
> 
> gen zlb = zlb_dummy;

.   /*  zlb state */
> 
> 
> *** NORMALIZATION;
. /* choice of potential GDP for normalization:
> 
>    rgdp_potCBO (cubic trend early, CBO late) or rgdp_pott6 (6th degree for full),
>    both fitted excluding Great Depression, WWII:  quarter>=1930 & quarter<1947*/
> 
> local ynorm rgdp_pott6;

.  /* rgdp_pott6 or rgdp_potcbo */
> 
> * BASIC VARIABLES;
. gen newsy = news/(L.`ynorm'*L.pgdp);
(1 missing value generated)

. gen rgov = ngov/pgdp;

. gen rtax = nfedcurrreceipts_nipa/pgdp;

. gen taxy = nfedcurrreceipts_nipa/ngdp;

. gen debty = pubfeddebt_treas/L.ngdp;
(3 missing values generated)

. gen lpgdp = ln(pgdp);

. gen infl = 400*D.lpgdp;
(1 missing value generated)

. * normalize variables and shorten names;
. gen y = rgdp/`ynorm';

. gen g = rgov/`ynorm';

.  gen bp = g;

.  /* Blanchard-Perotti shock is just orthogonalized current g */
> 
> 
> * Calculate mean, median, etc. of slack duration;
. /*
> tsspell slack, end(hrend) seq(hrseq);
> summ hrseq if hrend & slack==1, detail;
> tab hrseq if hrend & slack==1;
> */
> *******************************************************************************;
. /* Options for VARs below
> 
> change sample according to:
> 
> no "if" is full sample
> if L.zlb ==1 or L.zlb==0
> if L.slack ==1 or L.slack==0;
> 
> add taxes:  var newsy g y taxy or var g y taxy;
> 
> add trends:  var newsy g y taxy if ..., lags(1/4) exog(t t2);
> 
> *******************************************************************************/
> 
> /* Military News identification;*/
> 
> var newsy g  y if L.recession== 1, lags(1/4);

Vector autoregression

Sample:  1891q1 - 2009q3, but with gaps         Number of obs     =        144
Log likelihood =   1215.969                     AIC               =  -16.34679
FPE            =   1.60e-11                     HQIC              =  -16.01996
Det(Sigma_ml)  =   9.29e-12                     SBIC              =  -15.54246

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
newsy                13     .016881   0.5307   162.8704   0.0000
g                    13      .00967   0.9882   12069.05   0.0000
y                    13     .023846   0.9442   2437.472   0.0000
----------------------------------------------------------------

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
newsy        |
       newsy |
         L1. |  -.4626967   .0844351    -5.48   0.000    -.6281864   -.2972069
         L2. |   -.553284   .0689464    -8.02   0.000    -.6884165   -.4181515
         L3. |  -.5561581   .0830498    -6.70   0.000    -.7189327   -.3933836
         L4. |  -.3785666   .0639005    -5.92   0.000    -.5038092    -.253324
             |
           g |
         L1. |   .3856788   .1507435     2.56   0.011     .0902269    .6811307
         L2. |   -.161269    .251431    -0.64   0.521    -.6540646    .3315266
         L3. |  -.3409109   .2348351    -1.45   0.147    -.8011792    .1193575
         L4. |   .0630003   .1476619     0.43   0.670    -.2264117    .3524123
             |
           y |
         L1. |   .0449402   .0713492     0.63   0.529    -.0949017     .184782
         L2. |   -.132682   .1233668    -1.08   0.282    -.3744766    .1091126
         L3. |   .1919536   .1223591     1.57   0.117    -.0478658    .4317729
         L4. |  -.1419527   .0716266    -1.98   0.047    -.2823382   -.0015672
             |
       _cons |   .0460824   .0171084     2.69   0.007     .0125506    .0796142
-------------+----------------------------------------------------------------
g            |
       newsy |
         L1. |   .2273138   .0483676     4.70   0.000      .132515    .3221126
         L2. |   .1619705   .0394951     4.10   0.000     .0845615    .2393795
         L3. |   -.153861   .0475741    -3.23   0.001    -.2471044   -.0606176
         L4. |  -.1612913   .0366046    -4.41   0.000     -.233035   -.0895476
             |
           g |
         L1. |   1.277971   .0863516    14.80   0.000     1.108725    1.447217
         L2. |  -.2743545   .1440292    -1.90   0.057    -.5566466    .0079375
         L3. |   .0481993   .1345224     0.36   0.720    -.2154599    .3118585
         L4. |  -.1179698   .0845863    -1.39   0.163     -.283756    .0478163
             |
           y |
         L1. |    .001729   .0408715     0.04   0.966    -.0783778    .0818357
         L2. |  -.0004244   .0706692    -0.01   0.995    -.1389335    .1380847
         L3. |   .0076189   .0700919     0.11   0.913    -.1297587    .1449965
         L4. |  -.0355153   .0410304    -0.87   0.387    -.1159334    .0449028
             |
       _cons |   .0345891   .0098003     3.53   0.000     .0153808    .0537974
-------------+----------------------------------------------------------------
y            |
       newsy |
         L1. |  -.0060442   .1192717    -0.05   0.960    -.2398125     .227724
         L2. |  -.1969211   .0973927    -2.02   0.043    -.3878072    -.006035
         L3. |  -.2087978   .1173148    -1.78   0.075    -.4387307     .021135
         L4. |  -.0707198   .0902648    -0.78   0.433    -.2476356     .106196
             |
           g |
         L1. |   .2266495    .212938     1.06   0.287    -.1907014    .6440003
         L2. |    .118422   .3551676     0.33   0.739    -.5776937    .8145376
         L3. |   -.429009   .3317245    -1.29   0.196    -1.079177    .2211591
         L4. |   .0972282   .2085849     0.47   0.641    -.3115907    .5060472
             |
           y |
         L1. |   1.449335   .1007868    14.38   0.000     1.251797    1.646874
         L2. |  -.7387716   .1742661    -4.24   0.000    -1.080327   -.3972163
         L3. |   .3783301   .1728426     2.19   0.029     .0395649    .7170953
         L4. |  -.1503013   .1011786    -1.49   0.137    -.3486077    .0480051
             |
       _cons |   .0524084    .024167     2.17   0.030     .0050419     .099775
------------------------------------------------------------------------------

. irf create irf, step(20) set(irf, replace);
(file irf.irf created)
(file irf.irf now active)
(file irf.irf updated)

. irf table oirf, impulse(newsy) response(newsy g y) ;

                                                    Results from irf

+--------------------------------------------------------------------------------------------------------------------+
|        |    (1)         (1)         (1)    |    (2)         (2)         (2)    |    (3)         (3)         (3)    |
|  step  |   oirf       Lower       Upper    |   oirf       Lower       Upper    |   oirf       Lower       Upper    |
|--------+-----------------------------------+-----------------------------------+-----------------------------------|
|0       | .016101     .014242     .017961   | .003768     .002326     .00521    | .00283      -.000871    .00653    |
|1       | -.005869    -.008374    -.003365  | .008481     .00606      .010901   | .004858     -.001442    .011157   |
|2       | -.003687    -.005841    -.001533  | .011085     .008027     .014143   | .004183     -.002696    .011063   |
|3       | -.002292    -.004766    .000183   | .007782     .004113     .01145    | .003261     -.004175    .010697   |
|4       | -.001048    -.003211    .001114   | .003996     .000077     .007916   | .00368      -.004646    .012005   |
|5       | .002913     .000735     .005092   | .003275     -.00037     .00692    | .003315     -.004619    .011249   |
|6       | .000259     -.00172     .002239   | .003476     .000262     .00669    | .002574     -.003995    .009144   |
|7       | -.000421    -.002059    .001216   | .003796     .001143     .006448   | .002208     -.002874    .007289   |
|8       | -.001261    -.00249     -.000033  | .003148     .000791     .005504   | .001672     -.00275     .006094   |
|9       | -.001001    -.00197     -.000032  | .001802     -.0005      .004103   | .001088     -.00285     .005027   |
|10      | .000295     -.00073     .001321   | .000729     -.001481    .00294    | .000605     -.002767    .003977   |
|11      | .000326     -.000402    .001053   | .000244     -.001948    .002436   | .00026      -.002739    .003258   |
|12      | .000184     -.000591    .000959   | .000255     -.001999    .002509   | 2.7e-06     -.002952    .002958   |
|13      | -.000199    -.000807    .000409   | .000259     -.002104    .002621   | -.00023     -.003329    .002869   |
|14      | -.000328    -.000765    .000109   | .000053     -.002401    .002506   | -.000396    -.003579    .002786   |
|15      | -.00008     -.000529    .000368   | -.000217    -.002628    .002194   | -.000506    -.003583    .002571   |
|16      | .000081     -.000264    .000425   | -.000383    -.00262     .001855   | -.000563    -.003452    .002325   |
|17      | .000149     -.000129    .000427   | -.000365    -.002393    .001663   | -.00057     -.003285    .002144   |
|18      | .000062     -.000198    .000321   | -.000257    -.002099    .001585   | -.000549    -.003086    .001989   |
|19      | -.000034    -.000252    .000184   | -.000169    -.001858    .00152    | -.00051     -.002827    .001806   |
|20      | -.000035    -.000221    .000152   | -.000137    -.001683    .00141    | -.000463    -.002494    .001568   |
+--------------------------------------------------------------------------------------------------------------------+
95% lower and upper bounds reported
(1) irfname = irf, impulse = newsy, and response = newsy
(2) irfname = irf, impulse = newsy, and response = g
(3) irfname = irf, impulse = newsy, and response = y

. irf graph oirf, impulse(newsy) response(newsy g  y) byopts(rescale) saving(newsslack.gph, replace);
(file newsslack.gph saved)

. var newsy g  y if L.recession== 0, lags(1/4);

Vector autoregression

Sample:  1891q4 - 2015q4, but with gaps         Number of obs     =        356
Log likelihood =   2723.515                     AIC               =  -15.08155
FPE            =   5.66e-11                     HQIC              =  -14.91269
Det(Sigma_ml)  =   4.55e-11                     SBIC              =  -14.65704

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
newsy                13     .064408   0.1620   68.83054   0.0000
g                    13     .008486   0.9922   45273.21   0.0000
y                    13     .013839   0.9740   13323.75   0.0000
----------------------------------------------------------------

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
newsy        |
       newsy |
         L1. |   .0478261   .0543525     0.88   0.379    -.0587028    .1543551
         L2. |   .2556795   .0544755     4.69   0.000     .1489095    .3624495
         L3. |   .0423141   .0581278     0.73   0.467    -.0716142    .1562424
         L4. |   .0146359   .0588255     0.25   0.804      -.10066    .1299318
             |
           g |
         L1. |   1.430885   .3637244     3.93   0.000     .7179981    2.143771
         L2. |  -2.725953   .6222252    -4.38   0.000    -3.945492   -1.506414
         L3. |   1.662475   .5465328     3.04   0.002     .5912906     2.73366
         L4. |  -.3784319   .2774188    -1.36   0.173    -.9221628    .1652991
             |
           y |
         L1. |   .2094354    .231925     0.90   0.367    -.2451292    .6639999
         L2. |  -.2004542   .3483752    -0.58   0.565     -.883257    .4823485
         L3. |  -.0250694    .339972    -0.07   0.941    -.6914024    .6412635
         L4. |  -.0309423   .2014781    -0.15   0.878     -.425832    .3639475
             |
       _cons |   .0530178   .0417582     1.27   0.204    -.0288268    .1348624
-------------+----------------------------------------------------------------
g            |
       newsy |
         L1. |    .006542   .0071614     0.91   0.361    -.0074941    .0205781
         L2. |   .0493599   .0071776     6.88   0.000      .035292    .0634277
         L3. |   .0501235   .0076588     6.54   0.000     .0351125    .0651345
         L4. |    .024489   .0077508     3.16   0.002     .0092978    .0396802
             |
           g |
         L1. |   1.326673   .0479238    27.68   0.000     1.232744    1.420602
         L2. |  -.4626899   .0819834    -5.64   0.000    -.6233745   -.3020054
         L3. |   .2921834   .0720103     4.06   0.000     .1510457     .433321
         L4. |  -.1646739   .0365523    -4.51   0.000     -.236315   -.0930327
             |
           y |
         L1. |  -.0306806   .0305581    -1.00   0.315    -.0905733    .0292122
         L2. |    .072907   .0459014     1.59   0.112     -.017058    .1628721
         L3. |  -.1103843   .0447942    -2.46   0.014    -.1981793   -.0225894
         L4. |   .0692935   .0265464     2.61   0.009     .0172634    .1213236
             |
       _cons |   .0007059    .005502     0.13   0.898    -.0100778    .0114897
-------------+----------------------------------------------------------------
y            |
       newsy |
         L1. |  -.0189107   .0116781    -1.62   0.105    -.0417993     .003978
         L2. |   .0321005   .0117045     2.74   0.006       .00916     .055041
         L3. |  -.0170216   .0124893    -1.36   0.173    -.0415001    .0074569
         L4. |   .0466128   .0126392     3.69   0.000     .0218404    .0713851
             |
           g |
         L1. |   .3049333   .0781494     3.90   0.000     .1517633    .4581033
         L2. |  -.5286548   .1336906    -3.95   0.000    -.7906834   -.2666261
         L3. |   .3782626   .1174274     3.22   0.001     .1481092    .6084161
         L4. |  -.1519504   .0596059    -2.55   0.011    -.2687757    -.035125
             |
           y |
         L1. |   1.282546   .0498311    25.74   0.000     1.184879    1.380213
         L2. |  -.4212615   .0748515    -5.63   0.000    -.5679677   -.2745553
         L3. |   .1548588    .073046     2.12   0.034     .0116913    .2980262
         L4. |  -.0532311   .0432893    -1.23   0.219    -.1380766    .0316144
             |
       _cons |   .0391452   .0089721     4.36   0.000     .0215602    .0567303
------------------------------------------------------------------------------

. irf create irf, step(20) set(irf, replace);
(file irf.irf created)
(file irf.irf now active)
(file irf.irf updated)

. irf table oirf, impulse(newsy) response(newsy g y) ;

                                                    Results from irf

+--------------------------------------------------------------------------------------------------------------------+
|        |    (1)         (1)         (1)    |    (2)         (2)         (2)    |    (3)         (3)         (3)    |
|  step  |   oirf       Lower       Upper    |   oirf       Lower       Upper    |   oirf       Lower       Upper    |
|--------+-----------------------------------+-----------------------------------+-----------------------------------|
|0       | .063221     .058578     .067865   | .002521     .001676     .003367   | .002019     .000615     .003422   |
|1       | .007054     .000431     .013677   | .003697     .002281     .005112   | .002162     -.000124    .004449   |
|2       | .014966     .008131     .021801   | .006985     .005128     .008843   | .003613     .000763     .006463   |
|3       | .009577     .002831     .016323   | .011732     .009314     .014151   | .004033     .000737     .007328   |
|4       | .00845      .00168      .015219   | .015742     .012681     .018803   | .007904     .004259     .011548   |
|5       | .005036     .000815     .009257   | .018142     .014387     .021896   | .009782     .005759     .013806   |
|6       | .003185     -.000922    .007292   | .02044      .016006     .024874   | .010946     .006605     .015287   |
|7       | .003471     -.000052    .006994   | .022103     .016994     .027211   | .012145     .007512     .016779   |
|8       | .001287     -.001981    .004556   | .023106     .017363     .02885    | .012809     .007901     .017717   |
|9       | .000756     -.0024      .003913   | .023838     .017513     .030162   | .01309      .007928     .018253   |
|10      | .000221     -.002903    .003345   | .024296     .017434     .031158   | .013116     .00772      .018511   |
|11      | -.00043     -.003558    .002698   | .024483     .017129     .031838   | .012993     .007381     .018604   |
|12      | -.000858    -.004041    .002325   | .024477     .016671     .032284   | .012674     .006862     .018485   |
|13      | -.00116     -.004412    .002093   | .024339     .016106     .032573   | .012238     .006235     .018242   |
|14      | -.001388    -.004711    .001935   | .024075     .015434     .032716   | .011734     .005542     .017927   |
|15      | -.001593    -.004982    .001796   | .023711     .014673     .03275    | .011161     .00478      .017543   |
|16      | -.001704    -.005139    .001732   | .023281     .013847     .032715   | .010548     .003974     .017123   |
|17      | -.001776    -.005235    .001683   | .022797     .012963     .03263    | .009915     .003143     .016688   |
|18      | -.001824    -.005285    .001637   | .022272     .012031     .032513   | .009273     .002299     .016248   |
|19      | -.001835    -.005277    .001606   | .021721     .011063     .032379   | .008631     .00145      .015812   |
|20      | -.001824    -.005223    .001576   | .021153     .010068     .032239   | .007999     .000611     .015388   |
+--------------------------------------------------------------------------------------------------------------------+
95% lower and upper bounds reported
(1) irfname = irf, impulse = newsy, and response = newsy
(2) irfname = irf, impulse = newsy, and response = g
(3) irfname = irf, impulse = newsy, and response = y

. irf graph oirf, impulse(newsy) response(newsy g  y) byopts(rescale) saving(newsnoslack.gph, replace);
(file newsnoslack.gph saved)

. 
end of do-file

. dsddsdddsds
command dsddsdddsds is unrecognized
r(199);

